In [1]:

import pandas as pd

data={'First Name':["Alice", 'Bob', 'Charlie', 'David'],
     'Age':[25, 30, 35, 40],
     'City':["New York", 'San Fransisco', 'Los Angeles', 'Chicago']}
df=pd.DataFrame(data)

In [2]:
#1

df=df.rename(columns={"First Name":"first_name", 'Age':'age', 'City':'city'})
df

  first_name  age           city
0      Alice   25       New York
1        Bob   30  San Fransisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [3]:
#2
df=df.head(3)
df

  first_name  age           city
0      Alice   25       New York
1        Bob   30  San Fransisco
2    Charlie   35    Los Angeles

In [21]:
#3
age=df['age']
print(age.mean())

30.0

In [4]:
#4
df[['first_name', 'city']]

  first_name           city
0      Alice       New York
1        Bob  San Fransisco
2    Charlie    Los Angeles

In [14]:
#5
import numpy as np
df['Salary']=np.random.randint(5000, 10000, size=len(df))
df

C:\Users\User\AppData\Local\Temp\ipykernel_6972\3798122353.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Salary']=np.random.randint(5000, 10000, size=len(df))

  first_name  age           city  Salary
0      Alice   25       New York    6087
1        Bob   30  San Fransisco    5873
2    Charlie   35    Los Angeles    6476

In [16]:
print('Dataframe summary statistics:\n', df.describe())

Dataframe summary statistics:
         age       Salary
count   3.0     3.000000
mean   30.0  6145.333333
std     5.0   305.703015
min    25.0  5873.000000
25%    27.5  5980.000000
50%    30.0  6087.000000
75%    32.5  6281.500000
max    35.0  6476.000000

In [3]:
data={'Month':['Jan', 'Feb', 'Mar', 'Apr'],
      'Sales':[5000, 6000, 7500, 8000],
      'Expenses':[3000, 3500, 4000, 4500]}
sales_and_expenses=pd.DataFrame(data)
print(sales_and_expenses)

  Month  Sales  Expenses
0   Jan   5000      3000
1   Feb   6000      3500
2   Mar   7500      4000
3   Apr   8000      4500

In [4]:
sales_and_expenses[['Sales', 'Expenses']].max()

Sales       8000
Expenses    4500
dtype: int64

In [5]:
sales_and_expenses[['Sales', 'Expenses']].min()

Sales       5000
Expenses    3000
dtype: int64

In [6]:
sales_and_expenses[['Sales', 'Expenses']].mean()

Sales       6625.0
Expenses    3750.0
dtype: float64

In [2]:
#puzzle1

import pandas as pd
import sqlalchemy as sa

connection_str = "mssql+pyodbc://DESKTOP-Q6HIHT2/master?driver=ODBC+Driver+17+for+SQL+Server"
engine=sa.create_engine(connection_str)
con=engine.connect()

lag=pd.read_sql(sa.text('select * from lag'), con=con)
lag['lagCurrentQuota']=lag['CurrentQuota'].shift(1, fill_value=0)
print(lag)

   BusinessEntityID  SalesYear  CurrentQuota  lagCurrentQuota
0               275       2005      367000.0              0.0
1               275       2005      556000.0         367000.0
2               275       2006      502000.0         556000.0
3               275       2006      550000.0         502000.0
4               275       2006     1429000.0         550000.0
5               275       2006     1324000.0        1429000.0

In [9]:
#puzzle2

connection_str = "mssql+pyodbc://DESKTOP-Q6HIHT2/master?driver=ODBC+Driver+17+for+SQL+Server"
engine=sa.create_engine(connection_str)
con=engine.connect()

lag=pd.read_sql(sa.text('select * from lag'), con=con)
lag['lagCurrentQuota']=lag['CurrentQuota'].shift(-1, fill_value=0)
print(lag)

   BusinessEntityID  SalesYear  CurrentQuota  lagCurrentQuota
0               275       2005      367000.0         556000.0
1               275       2005      556000.0         502000.0
2               275       2006      502000.0         550000.0
3               275       2006      550000.0        1429000.0
4               275       2006     1429000.0        1324000.0
5               275       2006     1324000.0              0.0

In [8]:
#puzzle3

connection_str = "mssql+pyodbc://DESKTOP-Q6HIHT2/master?driver=ODBC+Driver+17+for+SQL+Server"
engine=sa.create_engine(connection_str)
con=engine.connect()

lag=pd.read_sql(sa.text('select * from EmpBirth'), con=con)
lag_filtered=lag[(lag['BirthDate'].dt.month==5)&(lag['BirthDate'].dt.day.between(7, 15))]
print(lag_filtered)

   EmpId  EmpName  BirthDate
2      3  Parveen 1977-05-07
4      5   Ramesh 1983-05-09

In [11]:
#puzzle4


connection_str = "mssql+pyodbc://DESKTOP-Q6HIHT2/master?driver=ODBC+Driver+17+for+SQL+Server"
engine=sa.create_engine(connection_str)
con=engine.connect()

lag=pd.read_sql(sa.text('select * from Movie'), con=con)
cte=lag.query("AName in ['Ambitabh', 'Vinod']")
result=cte.merge(lag, left_on='MName', right_on='AName', suffixes=("_cte", "_movie"))
fnl_result=result[['Roles_cte']=='Actor']
print(fnl_result)

KeyError: False

In [23]:
#puzzle5


connection_str = "mssql+pyodbc://DESKTOP-Q6HIHT2/master?driver=ODBC+Driver+17+for+SQL+Server"
engine=sa.create_engine(connection_str)
con=engine.connect()

lag=pd.read_sql(sa.text('select * from PQ'), con=con)

cleaned=df.groupby("ID", as_index=False).agg({'Name':'first', 'Typed':'first'})
print(cleaned)

   ID Name Typed
0   1    P     Q